DataProcessors/УправлениеДальнометром.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>УправлениеДальнометром</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПинаTrig</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПинаEcho</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияРасстояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициирующийПроцесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправлениеДальнометром/Ext/ObjectModule.bsl
//Дальнометр должен быть подключен к цифровым пинам

Процедура ПроцессДляСервераЧтениеРасстоянияУЗДальнометром(Процесс = "") Экспорт
	
	ИнициирующийПроцесс = Процесс;
	
	ИнициализацияЧтениеРасстоянияУЗДальнометром();
	ДатаПолученияРасстояния = '00010101';
	ПолучитьРасстояниеУЗДальнометром();
	
	Если ДатаПолученияРасстояния <> '00010101' Тогда 
		ЗаписатьТекущееДанные();	
	КонецЕсли;
	
КонецПроцедуры

//////
Функция ЗаполнитьПиныУЗДальнометром() 
	
	СообщениеСНенайденнымиПинами = "";
	
	СтрокаСНастройкой = Оборудование.Пины.Найти("Trig", "Наименование");
	Если СтрокаСНастройкой = Неопределено Тогда 
		СообщениеСНенайденнымиПинами = СообщениеСНенайденнымиПинами + "Не задан ПИН для ""Trig""; ";
	Иначе
		НомерПинаTrig = СтрокаСНастройкой.НомерПина;
	КонецЕсли;
	
	СтрокаСНастройкой = Оборудование.Пины.Найти("Echo", "Наименование");
	Если СтрокаСНастройкой = Неопределено Тогда 
		СообщениеСНенайденнымиПинами = СообщениеСНенайденнымиПинами + "Не задан ПИН для ""Echo""; ";
	Иначе
		НомерПинаEcho = СтрокаСНастройкой.НомерПина;
	КонецЕсли;
	
	Возврат СообщениеСНенайденнымиПинами;
	
КонецФункции

Процедура ИнициализацияЧтениеРасстоянияУЗДальнометром()
		
	Ответ = ЗаполнитьПиныУЗДальнометром();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры
Процедура ПолучитьРасстояниеУЗДальнометром()
	
	Ответ = К.UzDistance(Оборудование, НомерПинаTrig, НомерПинаEcho); 

	Если ТипЗнч(Ответ) = Тип("Число") Тогда 
		Расстояние = Ответ;
		ДатаПолученияРасстояния = ТекущаяДата();
	Иначе
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + "Не удалось получить расстояние";
	КонецЕсли;	
	
КонецПроцедуры
/////	

Процедура ЗаписатьТекущееДанные()
	
	ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "Расстояние", Расстояние, ДатаПолученияРасстояния); 
	
КонецПроцедуры
